Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdhi_rx/src/r_sdhi_int.c
/***********************************************************************************************************************
* Copyright (c) 2017 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdhi_int.c
* Version      : 2.12
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDHI API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 31.07.2017 2.00    First Release
*              : 20.05.2019 2.04    Added support for GNUC and ICCRX.
*                                   Fixed coding style. 
*              : 22.11.2019 2.06    Modified comment of API function to Doxygen style.
*              : 27.12.2022 2.10    Updated slash format of included header file paths for Linux compatibility.
*              : 15.03.2025 2.12    Updated disclaimer.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdhi_rx_if.h"
#include "./src/r_sdhi_rx_private.h"

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SDHI_SetIntMask
 *****************************************************************************************************************/ /**
 * @brief This function controls the SD interrupt mask registers to enable SD interrupts.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] mask1
 *             SD interrupt mask register 1 (SDIMSK1) control\n 
 *              To enable an interrupt, set the target bit to 1.\n 
 *              To not change the interrupt setting, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit is invalid.\n 
 *              For details of the SDIMSK1 register, refer to section 3.9 in application note.
 * @param[in] mask2
 *             SD interrupt mask register 2 (SDIMSK2) control\n 
 *              To enable an interrupt, set the target bit to 1.\n 
 *              To not change the interrupt setting, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit is invalid.\n 
 *              For details of the SDIMSK2 register, refer to section 3.9 in application note.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Controls SD interrupt mask register 1 (SDIMSK1) and SD interrupt mask register 2 (SDIMSK2) to enable 
 *            SD interrupts.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            After calling this function, call the R_SDHI_EnableIcuInt() function to enable SDHI ICU controller 
 *            interrupts. If not enabled, no SD interrupts will be generated.
 */
sdhi_status_t R_SDHI_SetIntMask(uint32_t channel, uint32_t mask1, uint32_t mask2)
{
    sdhi_sdhndl_t * p_hndl = 0;
    uint32_t mask1_reg = 0;
    uint32_t mask2_reg = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Set the sdimsk1 and sdimsk2 according to the specified mask1 and mask2. ---- */
    mask1_reg = (SDHI_INREG(p_hndl, SDHI_SDIMSK1) & (~mask1));
    mask2_reg = ((SDHI_INREG(p_hndl, SDHI_SDIMSK2) & (~mask2)) | SDHI_SDIMSK2_BIT11);

    /* ---- Set the SDIMSK1 and SDIMSK2 registers. ---- */
    SDHI_OUTREG(p_hndl, SDHI_SDIMSK1, mask1_reg);
    SDHI_OUTREG(p_hndl, SDHI_SDIMSK2, mask2_reg);
    if (SDHI_INREG(p_hndl, SDHI_SDIMSK2) == mask2_reg)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_SetIntMask() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_ClearIntMask
 *****************************************************************************************************************/ /**
 * @brief This function controls the SD interrupt mask registers to disable SD interrupts.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] mask1
 *             SD interrupt mask register 1 (SDIMSK1) control\n 
 *              To disable an interrupt, set the target bit to 1.\n 
 *              To not change the interrupt setting, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit is invalid.\n 
 *              For details of the SDIMSK1 register, refer to section 3.9 in application note.
 * @param[in] mask2
 *             SD interrupt mask register 2 (SDIMSK2) control\n 
 *              To disable an interrupt, set the target bit to 1.\n 
 *              To not change the interrupt setting, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit is invalid.\n 
 *              For details of the SDIMSK2 register, refer to section 3.9 in application note.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Controls SD interrupt mask register 1 (SDIMSK1) and SD interrupt mask register 2 (SDIMSK2) to disable
 *            SD interrupts.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            Before calling this function, call the R_SDHI_DisableIcuInt() function to disable SDHI ICU controller
 *            interrupts. If not disabled, SD interrupts may be generated at unintended times.
 */
sdhi_status_t R_SDHI_ClearIntMask(uint32_t channel, uint32_t mask1, uint32_t mask2)
{
    sdhi_sdhndl_t * p_hndl = 0;
    uint32_t mask1_reg = 0;
    uint32_t mask2_reg = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Clear the sdimsk1 and sdimsk2 according to the specified mask1 and mask2. ---- */
    mask1_reg = (SDHI_INREG(p_hndl, SDHI_SDIMSK1) | mask1);
    mask2_reg = ((SDHI_INREG(p_hndl, SDHI_SDIMSK2) | mask2) | SDHI_SDIMSK2_BIT11);

