Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdhi_rx/src/r_sdhi_int.c
    /* ---- Clear the SDIMSK1 and SDIMSK2 registers. ---- */
    SDHI_OUTREG(p_hndl, SDHI_SDIMSK1, mask1_reg);
    SDHI_OUTREG(p_hndl, SDHI_SDIMSK2, mask2_reg);
    if (SDHI_INREG(p_hndl, SDHI_SDIMSK2) == mask2_reg)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_ClearIntMask() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_ClearSdstsReg
 *****************************************************************************************************************/ /**
 * @brief This function controls the SD status registers to clear interrupt flags.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] clear_sdsts1
 *             SD status register 1 (SDSTS1) control\n 
 *              To 0 clear an interrupt flag, set the target bit to 1.\n 
 *              To not change the interrupt flag, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit is invalid.\n 
 *              For details of the SDSTS1 register, refer to section 3.11 in application note.
 * @param[in] clear_sdsts2
 *             SD status register 2 (SDSTS2) control\n 
 *              To 0 clear an interrupt flag, set the target bit to 1.\n 
 *              To not change the interrupt flag, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit and b12 (Reserved bit) is invalid.\n 
 *              For details of the SDSTS2 register, refer to section 3.11 in application note.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Clears interrupt flags in SD status register 1 (SDSTS1) and SD status register 2 (SDSTS2).
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            Before calling this function, call the R_SDHI_DisableIcuInt() function to disable SDHI ICU controller
 *            interrupts. If not disabled, SD interrupts may be generated at unintended times.
 */
sdhi_status_t R_SDHI_ClearSdstsReg(uint32_t channel, uint32_t clear_sdsts1, uint32_t clear_sdsts2)
{
    sdhi_sdhndl_t   * p_hndl = 0;
    uint32_t            sdsts1 = 0;
    uint32_t            sdsts2 = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Clear the SDSTS1 and SDSTS2 according to the specified clear_sdsts1 and clear_sdsts2. ---- */
    sdsts1 = (SDHI_INREG(p_hndl, SDHI_SDSTS1) & (~clear_sdsts1));
    sdsts2 = ((SDHI_INREG(p_hndl, SDHI_SDSTS2) & (~clear_sdsts2)) | SDHI_SDIMSK2_BIT11);

    /* Clear the SDSTS1 and SDSTS2 registers. */
    SDHI_OUTREG(p_hndl, SDHI_SDSTS1, sdsts1);
    SDHI_OUTREG(p_hndl, SDHI_SDSTS2, sdsts2);

    if (SDHI_INREG(p_hndl, SDHI_SDSTS2) == sdsts2)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_ClearSdstsReg() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_SetSdioIntMask
 *****************************************************************************************************************/ /**
 * @brief This function controls the SDIO interrupt mask registers to enable SDIO interrupts.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] mask
 *             SDIO interrupt mask register (SDIOIMSK) control\n 
 *              To enable an interrupt, set the target bit to 1.\n 
 *              To not change the interrupt setting, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit and b2-b1 (Reserved bit) is invalid.\n 
 *              For details of the SDIOIMSK register, refer to section 3.12 in application note.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Controls the SDIO interrupt mask register (SDIOIMSK) to enable interrupts.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            After calling this function, call the R_SDHI_EnableIcuInt() function to enable SDHI ICU controller
 *            interrupts. If not enabled, no SDIO interrupts will be generated.
 */
sdhi_status_t R_SDHI_SetSdioIntMask(uint32_t channel, uint32_t mask)
{
    sdhi_sdhndl_t       * p_hndl = 0;
    uint32_t mask_reg = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Set the sdioimsk according to the specified mask. ---- */
    mask_reg = ((SDHI_INREG(p_hndl, SDHI_SDIOIMSK) & (~mask)) | SDHI_SDIOSTS_INIT);

    /* ---- Set the SDIOIMSK register. ---- */
    SDHI_OUTREG(p_hndl, SDHI_SDIOIMSK, mask_reg);
    if (SDHI_INREG(p_hndl, SDHI_SDIOIMSK) == mask_reg)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;

