Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdhi_rx/src/r_sdhi_int.c
} /* End of function R_SDHI_SetSdioIntMask() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_ClearSdioIntMask
 *****************************************************************************************************************/ /**
 * @brief This function controls the SDIO interrupt mask registers to disable SDIO interrupts.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] mask
 *             SDIO interrupt mask register (SDIOIMSK) control\n 
 *              To disable an interrupt, set the target bit to 1.\n 
 *              To not change the interrupt setting, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit and b2-b1 (Reserved bit) is invalid.\n 
 *              For details of the SDIOIMSK register, refer to section 3.12 in application note.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Controls the SDIO interrupt mask register (SDIOIMSK) to disable interrupts.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            Before calling this function, call the R_SDHI_DisableIcuInt() function to disable SDHI ICU controller
 *            interrupts. If not disabled, SD interrupts may be generated at unintended times.
 */
sdhi_status_t R_SDHI_ClearSdioIntMask(uint32_t channel, uint32_t mask)
{
    sdhi_sdhndl_t       * p_hndl = 0;
    uint32_t mask_reg = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Clear the sdioimsk. ---- */
    mask_reg = ((SDHI_INREG(p_hndl, SDHI_SDIOIMSK) | mask) | SDHI_SDIOSTS_INIT);

    /* ---- Clear the SDIOIMSK register. ---- */
    SDHI_OUTREG(p_hndl, SDHI_SDIOIMSK, mask_reg);
    if (SDHI_INREG(p_hndl, SDHI_SDIOIMSK) == mask_reg)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;

} /* End of function R_SDHI_ClearSdioIntMask() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_ClearSdiostsReg
 *****************************************************************************************************************/ /**
 * @brief This function controls the SDIO status registers to clear interrupt flags.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] clear
 *             SDIO status register (SDIOSTS) control\n 
 *              To clear an interrupt flag, set the target bit to 1.\n 
 *              To not change the interrupt flag, clear the target bit to 0.\n 
 *              However, setting to the Read Only bit and b2-b1 (Reserved bit) is invalid.\n 
 *              For details of the SDIOSTS register, refer to section 3.14 in application note.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Clears interrupt flags in the SDIO status register (SDIOSTS).
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            Before calling this function, call the R_SDHI_DisableIcuInt() function to disable SDHI ICU controller
 *            interrupts. If not disabled, SD interrupts may be generated at unintended times.
 */
sdhi_status_t R_SDHI_ClearSdiostsReg(uint32_t channel, uint32_t clear)
{
    sdhi_sdhndl_t   * p_hndl = 0;
    uint32_t          sdiosts = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Clear the SDIOSTS according to the specified clear value. ---- */
    sdiosts = ((SDHI_INREG(p_hndl, SDHI_SDIOSTS) & (~clear)) | SDHI_SDIOSTS_INIT);

    /* Clear the SDIOSTS register. */
    SDHI_OUTREG(p_hndl, SDHI_SDIOSTS, sdiosts);
    if (SDHI_INREG(p_hndl, SDHI_SDIOSTS) == sdiosts)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDHI_SUCCESS;
} /* End of function R_SDHI_ClearSdiostsReg() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_IntCallback
 *****************************************************************************************************************/ /**
 * @brief This function registers the callback function for the card access interrupt (CACI) 
 *        and card detect interrupt (CDETI).
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] (*callback)(uint32_t,uint32_t)
 *             Callback function to be registered.\n 
 *             If set to a null pointer, no callback function is registered.\n 
 *             The first argument (uint32_t) contains the value of SD status register 1 (SDSTS1).\n 
 *             The second argument (uint32_t) contains the value of SD status register 2 (SDSTS2).
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Registers the callback function for the card access interrupt (CACI) and card detect interrupt (CDETI).
 *            The callback function registered by this function is called as a subroutine of the interrupt handler 
 *            when an interrupt is generated by a change in the SD protocol status.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required. \n 
 *            The callback function registered by this function is different from the callback functions of the SD 
 *            buffer access interrupt (SBFAI) and SDIO access interrupt (SDACI). Therefore, this callback function 
 *            is not called when the above-mentioned interrupts occur.
 */
sdhi_status_t R_SDHI_IntCallback(uint32_t channel, sdhi_status_t (* callback)(uint32_t, uint32_t))
{
    sdhi_sdhndl_t * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* Not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

